---
kind: event
id: E:Autodesk.Revit.UI.UIApplication.FabricationPartBrowserChanged
source: html/4b9bd1fa-925a-a5a3-af6c-d7b7b54e3ee7.htm
---
# Autodesk.Revit.UI.UIApplication.FabricationPartBrowserChanged Event

Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.

## Syntax (C#)
```csharp
public event EventHandler<FabricationPartBrowserChangedEventArgs> FabricationPartBrowserChanged
```

## Remarks
More docs about the different conditions goes here